### #1. Importing libraries

In [1]:
import pandas as pd
import numpy as np
import os

### #2. Exercise work-through

In [2]:
## Creating a pathname to easily access our data
pathname=r'/Users/alejandrocisneros/Desktop/Data Analysis Coursework/Data Immersion/Achievement 4/02-2024 Instacart Basket Analysis'

In [3]:
pathname

'/Users/alejandrocisneros/Desktop/Data Analysis Coursework/Data Immersion/Achievement 4/02-2024 Instacart Basket Analysis'

In [6]:
df_prods=pd.read_csv(os.path.join(pathname, '2. Data', 'Original Data', 'products.csv'))

In [8]:
df_orders=pd.read_csv(os.path.join(pathname, '2. Data', 'Prepared Data', 'orders_wrangled.csv'))

In [9]:
df_orders.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [13]:
#Creating a data frame to practice working with mixed data types in a single column
df_test=pd.DataFrame()

In [16]:
#Creating a mixed column within the new dataset ('mix' is the column name)
df_test['mix']=['a', 'b', 1, True]

In [15]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [19]:
#This line of code identifies the columns that have more than 1 data type. It does so by listing any column in
#which there is a row with a different data type than that of the first row.
for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [ ]:
# The above results shows us that the column mix does indeed contain

In [21]:
#Here, we are changing the data type for the column 'mix' so that all values are reformatted into 'str' values.
df_test['mix']=df_test['mix'].astype('str')

In [22]:
#Running code to test if reformatting data types worked.
df_test.dtypes

mix    object
dtype: object

### Success!

In [23]:
#Checking to see how null value count in the products dataframe
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

### There are 16 products who are missing a value (missing a name in this case)

In [27]:
#Creating a subset to evaluate all the obvervations with a null 'product_name' value
df_nan=df_prods[df_prods['product_name'].isnull()]

In [28]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [29]:
df_prods.shape

(49693, 5)

In [30]:
df_prods_clean=df_prods[df_prods['product_name'].isnull()==False]

In [31]:
df_prods_clean

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

### Operation was successful

In [32]:
#Creating another subset of duplicated entries within the clean product dataframe
df_dups=df_prods_clean[df_prods_clean.duplicated()]

In [33]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [34]:
df_prods_clean.shape

(49677, 5)

In [36]:
#Finishing the data cleaning by deleting all duplicates from the df_prods_clean dataframe, which already had 
#missing values erased
df_prods_clean_no_dups=df_prods_clean.drop_duplicates()

In [37]:
df_prods_clean_no_dups.shape

(49672, 5)

#### The 5 duplicate entries were deleted, as shown by 5 less rows in the final df. In total, 21 entries were deleted (16 missing values, 5 duplicate values)

In [38]:
df_prods_clean_no_dups.to_csv(os.path.join(pathname, '2. Data', 'Prepared Data', 'products_checked.csv'))

## End of work-through problems

## Start Exercise 4.5

### Question 1: Done above

### Question 2: Run df.describe() function on your df_ords dataframe. Report anything unusual (emphasis on min/max)

In [39]:
df_orders.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

#### There are fewer counts for the days_since_last_order columns than all others. This means there are missing values

### Question 3: Check for mixed-type data in your df_orders dataframe.

In [42]:
#Running this code by identifying columns with any row containing a different data type to the first row in column
for col in df_orders.columns.tolist():
  mixed = (df_orders[[col]].map(type) != df_orders[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_orders[mixed]) > 0:
    print (col)

### Question 4: If you find mixed-type data, fix it. The column in question should contain observations of a single data type.

#### 4Answer: There are no columns with mixed data types in df_orders

### Question 5: Run a check for missing values in your df_ords dataframe.

In [44]:
df_orders.isnull().sum()

Unnamed: 0                    0
order_id                      0
user_id                       0
order_number                  0
orders_day_of_week            0
order_hour_of_day             0
days_since_last_order    206209
dtype: int64

In [46]:
#To see the scale of missing values and decide on best course of action, we will run df.shape
df_orders.shape

(3421083, 7)

In [48]:
## 206 thousand out of 3.421 million (roughly 6% of the data). Given this, we will impute the missing values with
## the mean.

### Question 6: Address the missing values using an appropriate method.

In [51]:
##As said above, we will inpute the missing values with the column mean. First, call .describe function
## Not necessary but visually shows us the mean
df_orders.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [52]:
#Assign the mean to a variable
days_since_last_order_mean=df_orders['days_since_last_order'].mean()

In [53]:
##Call on a function to replace all missing values in the column with the column mean
df_orders['days_since_last_order'].fillna(days_since_last_order_mean, inplace=True)

In [54]:
## Can call df.describe or check column specific count
df_orders['days_since_last_order'].count()

3421083

#### Success, we now have equal number of values across all columns!

### Question 7: Run a check for duplicate values in your df_ords data.

In [58]:
## Creating a subset to examine duplicated values in df_orders
df_orders_dup=df_orders[df_orders.duplicated()]

In [59]:
## First, we want to check the duplicate values out by calling the new subset
df_orders_dup

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_last_order]
Index: []

### Question 8: Address the duplicates using an appropriate method.

### There are no duplicate entries in the df_orders database

### Question 9: Export final files

In [60]:
df_orders.to_csv(os.path.join(pathname, '2. Data', 'Prepared Data', 'orders_clean.csv'))

In [61]:
## Already exported products_checked.csv in above section